import pytest


@pytest.fixture
def операции():
    return [
        {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
        {"id": 142264268, "state": "EXECUTED", "date": "2019-04-04T23:20:05.206878"},
        {"id": 873106923, "state": "EXECUTED", "date": "2019-03-23T01:09:46.296404"},
        {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
    ]


@pytest.fixture
def номера_карт():
    return [
        (7000792289606362, "7000 79** **** 6362"),
        (7000792289606361, "7000 79** **** 6361"),
        (1234567890123456, "1234 56** **** 3456"),
    ]


@pytest.fixture
def номера_счетов():
    return [
        (40817810099910004312, "**4312"),
        (73654108430135874305, "**4305"),
    ]
