import pytest

from src.widget import get_date, mask_account_card


@pytest.mark.parametrize(
    "строка, ожидаемый_результат",
    [
        ("Visa Platinum 7000792289606361", "Visa Platinum 7000 79** **** 6361"),
        ("Maestro 7000792289606361", "Maestro 7000 79** **** 6361"),
        ("MasterCard 1234567890123456", "MasterCard 1234 56** **** 3456"),
    ],
)
def test_маскирование_карты_в_строке(строка, ожидаемый_результат):
    assert mask_account_card(строка) == ожидаемый_результат


@pytest.mark.parametrize(
    "строка, ожидаемый_результат",
    [
        ("Счет 73654108430135874305", "Счет **4305"),
    ],
)
def test_маскирование_счета_в_строке(строка, ожидаемый_результат):
    assert mask_account_card(строка) == ожидаемый_результат


@pytest.mark.parametrize(
    "строка",
    ["", "Visa", "Счет 123"],
)
def test_некорректная_строка(строка):
    assert mask_account_card(строка) == "Неправильно введен номер счёта"


@pytest.mark.parametrize(
    "дата, ожидаемый_результат",
    [
        ("2024-03-11T02:26:18.671407", "11.03.2024"),
        ("2024-01-01T10:00:00.000000", "01.01.2024"),
        ("2023-12-31T23:59:59.999999", "31.12.2023"),
    ],
)
def test_преобразование_даты(дата, ожидаемый_результат):
    assert get_date(дата) == ожидаемый_результат


def test_некорректная_дата():
    assert get_date("не дата") == "Неправильно введена дата"
